using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using YearIterator;

namespace YearFacts.Years
{
    public class Year1968_1970 : Year, IYear
    {
        public Year1968_1970()
        {
            this.horribleTruths = new List<string>()
            {
                "Хонконгски грип или H3N2 (1968 - 1970). Петдесет години след испанския грип, друг грипен вирус, H3N2, се разпространи по целия свят. Много източници посочват, че общият брой на смъртните случаи в световен мащаб е около 1 милион души, от които около 100 000 само в САЩ.",
                "Пандемията от 1968 г. е третата от грип, възникнала през 20-ти век, като другите две са испанския грип през 1918 г. и азиатският грип от 1957 г. Смята се, че вирусът, който е предизвикал азиатския грип, е мутирал и е появил отново 10 години по-късно през 1968 година, наречен хонконгски грип или H3N2.",
                "Въпреки че не е толкова смъртоносен, колкото грипната епидемия през 1918 г., H3N2 е силно заразен, като 500 000 души се заразяват в рамките само на 2 седмици от първия регистриран случай в Хонконг. Най-често от вируса страдат възрастни хора над 65 години. В САЩ смъртността от тази грипна зараза е 33 800 души.",
                " Пандемията помогна на световната медицина да разбере жизненоважната роля на ваксините за предотвратяване на бъдещи огнища."
            };
        }
        public void Add(string fact)
        {
            this.horribleTruths.Add(fact);
        }
        public IIterator CreateIterator()
        {
            return new Year1968_1970Iterator(this.horribleTruths);
        }

        public override string ToString()
        {
            return "1968_1970";
        }
    }
}
