using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using YearIterator;

namespace YearFacts.Years
{
    public class Year2009_2010 : Year, IYear
    {
        public Year2009_2010()
        {
            this.horribleTruths = new List<string>()
            {
                "Свински грип или H1N1 (2009 - 2010). През април-май 2009 г. в Мексико и Съединените щати е открито огнище на нов щам на грипния вирус. СЗО и центровете за контрол и профилактика на заболяванията на САЩ изразяват сериозна загриженост за този нов щам, защото се предава много от човек на човек.",
                "Нова форма на вируса на грипа заразява приблизително 60.8 милиона души в САЩ, като смъртните случаи в световен мащаб са 575 400. Наречен е 'свински грип', тъй като предава от прасета на хора и се различава от типичните грипни зарази по това, че 80% от смъртните случаи, причинени от вируса,",
                " настъпват при хора по-млади от 65 години, докато до тогава от 70% до 90% от смъртни случаи от грипни вируси се наблюдават при по-възрастните, над 65-годишни хора.",
                "На 11 юни 2009 г. СЗО обяви пандемията от свински грип - първата пандемия след 40 години до тогава, като е определяна шестата степен на заплаха от 6 възможни.",
                "В Египет превантивните мерки за предотвратяване на разпространението на грип доведоха до безредици в Кайро, които провокираха земеделските производители. Властите са били принудени да предприемат доста крайни мерки за разпръскване на протестите."
            };
        }
        public void Add(string fact)
        {
            this.horribleTruths.Add(fact);
        }
        public IIterator CreateIterator()
        {
            return new Year2009_2010Iterator(this.horribleTruths);
        }

        public override string ToString()
        {
            return "2009_2010";
        }
    }
}
